# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'

# Binaries
brew 'curl'
brew 'bat'
brew 'git'
brew 'getantibody/tap/antibody'
brew 'htop'
brew 'mackup'
brew 'mas'
brew 'neofetch'
brew 'tldr'
brew 'trash'
brew 'tree'
brew 'winetricks'
brew 'wifi-password'
brew 'youtube-dl'
brew 'zsh'

# Development
brew 'node@10'
brew 'yarn'
cask 'java8'
brew 'maven'

# Apps
cask 'aerial'
cask 'alfred'
cask 'appcleaner'
cask 'caffeine'
cask 'cheatsheet'
cask 'dash'
cask 'firefox'
cask 'google-chrome'
cask 'headset'
cask 'iina'
cask 'imageoptim'
cask 'insomnia'
cask 'iterm2'
cask 'itsycal'
cask 'lastpass'
cask 'nightowl'
# cask 'onyx'
cask 'postman'
cask 'sequel-pro'
cask 'shuttle'
cask 'sizeup'
cask 'skype'
cask 'slack'
cask 'spectacle'
cask 'sublime-text'
cask 'sublime-merge'
cask 'tableplus'
cask 'telegram'
# cask 'tinkertool'
cask 'tor-browser'
cask 'transmission'
cask 'transmit'
# cask 'virtualbox'
# cask 'virtualbox-extension-pack'
cask 'visual-studio-code'
cask 'vlc'
cask 'xquartz'
cask 'whatsapp'
cask 'wine-staging'
cask 'yujitach-menumeters'

# Quicklook
cask 'qlcolorcode'
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask 'qlstephen'
cask 'quicklook-json'
cask 'quicklook-csv'
cask "webpquicklook"

# Fonts
cask 'font-fira-code'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask "font-firacode-nerd-font"
cask "font-firacode-nerd-font-mono"

# Mac App Store
# mas 'MindNode 5', id: 1289197285
# mas 'The Unarchiver', id: 425424353
# mas 'WhatsApp Desktop', id: 1147396723 
# mas 'Monosnap'
