# Taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/bundle'

# Binaries
brew 'bat'
brew 'git'
brew 'mackup'
brew 'mas'
brew 'trash'
brew 'tree'
brew 'zsh'
brew 'zsh-completions'

# Development
brew 'node@10'
brew 'yarn'
cask 'java8'
brew 'maven'

# Apps
cask 'aerial'
cask 'alfred'
cask 'bitwarden'
cask 'caffeine'
cask 'dash'
cask 'enpass'
cask 'firefox'
cask 'google-backup-and-sync'
cask 'google-chrome'
cask 'headset'
cask 'hipchat'
cask 'iina'
cask 'imageoptim'
cask 'insomnia'
cask 'nightowl'
cask 'postman'
cask 'sequel-pro'
cask 'shuttle'
cask 'sizeup'
cask 'skype'
cask 'spectacle'
cask 'sublime-text'
cask 'sublime-merge'
cask 'tableplus'
cask 'telegram'
cask 'tor-browser'
cask 'transmission'
cask 'transmit'
# cask 'virtualbox'
# cask 'virtualbox-extension-pack'
cask 'visual-studio-code'
cask 'vlc'

# Quicklook
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'quicklook-json'
cask 'quicklook-csv'
cask 'qlstephen'

# Fonts
cask 'font-fira-code'
cask 'font-source-code-pro-for-powerline'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'

# Mac App Store
# mas 'MindNode 5', id: 1289197285
# mas 'The Unarchiver', id: 425424353
# mas 'WhatsApp Desktop', id: 1147396723 
